Конфигурация/Documents/ПереоценкаВалютныхЦенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереоценкаВалютныхЦенностей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccountingRegisters/ЕдиныйБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>ЕдиныйБухгалтерскийУчет</Name>
			<ChartOfAccounts>ChartOfAccounts.Единый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпераций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиУчетаАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаАктивов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АналитикаДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантОтраженияДебиторскойЗадолженностиПриПолномПогашении</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыделятьНалогПоДивидендам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПереоценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияДивидендов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОтраженияДивидендов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаДивидендов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаПереоценки</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаВЗалоге</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаПереоценкиВЗалоге</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаДоходовОтРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаДоходовПоследнееПогашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаДоходовОтПереоценки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьДосрочноПолученныеПроцентыВДоходахБудущихПериодов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражениеДоходаАммортизационныхОблигаций</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтраженияДоходаАммортизационныхОблигаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоцениватьВДеньОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоцениватьВНерабочиеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассификацияАктиваПоСрочности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАктивовПоСрочности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодикаРасчетаСрокаКупона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАктивовПоСрочности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаПерекурсовки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаИндексацииНоминала</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаИндексацииНоминалаЗаВремяВладения</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаДоходовИндексацииНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПереоценкиПереданныхВЗалог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоцениватьВЗалогеВНерабочиеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоначислятьКупонДоПолнойСтоимостиПередПродажейИПогашением</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриПогашенииВДоходеОтражатьТолькоРазницу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаПервоначальногоПризнания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаДоходовПогашенияИндексируемогоНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УчитыватьПереоценкуВСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/МетодикиПерекурсовкиВалютныхАктивовИОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>МетодикиПерекурсовкиВалютныхАктивовИОбязательств</Name>
			<Comment>#540061</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереоцениватьВНачалеИКонцеДня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоцениватьКаждымДокументомИВКонцеДняПоНастройкамПериодичности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПереоценкаВалютныхЦенностей/Ext/ObjectModule.bsl
Процедура ОбработкаПроведенияЕПС(Отказ, Режим)
	
	// #404987 - хардкод для Большого: задолженность по погашению (тела или купона) на 500х счетах нужно перекурсовать ЕЖЕДНЕВНО
	// остальное ежемесячно
	ЭтоБольшой = (Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Дата) = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Большой"));
	ЭтоКонецМесяца = (НачалоДня(ЭтотОбъект.Дата) = НачалоДня(КонецМесяца(ЭтотОбъект.Дата)));
	
	ДатаПереоценки = НачалоДня(ЭтотОбъект.Дата);
	
	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	МетодикаПерекурсовкиВалютныхАктивовИОбязательств = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, "МетодикаПерекурсовкиВалютныхАктивовИОбязательств");
	
	МассивДопАналитикиПоЦБ = Новый Массив;
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
	
	// ма не должны перекурсовывать просроченное погашение
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПогашениеКупонаНеИсполненноеВСрок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА КАК Счет
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаРезервов
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКупона
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокА
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокП
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаСчетовУчетаБумаг = РезультатЗапроса.Выгрузить();
	ТаблицаИсключаемыхСчетов = БухгалтерскийУчетЕПС.НеПерекурсовыватьСчета();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто3 КАК Субконто3,
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток * КурсВалютыОстатка.Курс / КурсВалютыОстатка.Кратность / КурсВалютыУчета.Курс * КурсВалютыУчета.Кратность КАК СуммаВВалютеУчета,
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид  КАК ВидСчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&МоментПереоценки,
		|			Счет.Валютный,
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И Валюта <> &ВалютаУчета) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыОстатка
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Валюта = КурсВалютыОстатка.Валюта,
		|	РегистрСведений.КурсыВалют КАК КурсВалютыУчета
		|ГДЕ
		|	КурсВалютыУчета.Валюта = &ВалютаУчета
		|	И КурсВалютыОстатка.Период = &Период
		|	И КурсВалютыУчета.Период = &Период";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВалютаУчета", Организация.ВалютаУчета);
	Запрос.УстановитьПараметр("Период", ДатаПереоценки);
	Если МетодикаПерекурсовкиВалютныхАктивовИОбязательств = Перечисления.МетодикиПерекурсовкиВалютныхАктивовИОбязательств.ПереоцениватьВНачалеИКонцеДня Тогда
		Запрос.УстановитьПараметр("МоментПереоценки", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	ИначеЕсли МетодикаПерекурсовкиВалютныхАктивовИОбязательств = Перечисления.МетодикиПерекурсовкиВалютныхАктивовИОбязательств.ПереоцениватьКаждымДокументомИВКонцеДняПоНастройкамПериодичности Тогда
		Запрос.УстановитьПараметр("МоментПереоценки", Новый Граница(КонецДня(ДатаПереоценки), ВидГраницы.Включая));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить методику перекурсовки активов и обязательств для  " + ЭтотОбъект.СчетДоверительногоУправления + " в организации " + ЭтотОбъект.Организация,,,,Отказ); 
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекСчет = ВыборкаДетальныеЗаписи.Счет;
		ТекДопАналитика = ВыборкаДетальныеЗаписи.ДополнительнаяАналитика;
		
		Если ТаблицаСчетовУчетаБумаг.Найти(ТекСчет, "Счет") <> Неопределено Тогда
			Если МассивДопАналитикиПоЦБ.Найти(ТекДопАналитика) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			//Продолжить;
		ИначеЕсли МассивДопАналитикиПоЦБ.Найти(ТекДопАналитика) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокиТаблицыИсключаемыхСчетов = ТаблицаИсключаемыхСчетов.НайтиСтроки(Новый Структура("Счет, ДополнительнаяАналитика", ТекСчет, ?(ЗначениеЗаполнено(ТекДопАналитика), ТекДопАналитика, Неопределено)));
		Если СтрокиТаблицыИсключаемыхСчетов.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСчет = ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами12 Тогда
			//это аванс				
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Субконто2) = Тип("СправочникСсылка.Договоры") Тогда
				ВидДоговора = ВыборкаДетальныеЗаписи.Субконто2.ВидДоговора;
				Если ВидДоговора = Перечисления.ВидыДоговоров.ДепозитарногоОбслуживания
					ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.ОтветственногоХранения
					ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.ВеденияРеестра
					ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СпецДепозитарногоОбслуживания
					ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СпецРегистрационногоОбслуживания Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// #404987 - хардкод для Большого: задолженность по погашению (тела или купона) на 500х счетах нужно перекурсовать ЕЖЕДНЕВНО
		// остальное ежемесячно
		Если ЭтоБольшой И НЕ ЭтоКонецМесяца И ДатаПереоценки < '20220101'
			И ВыборкаДетальныеЗаписи.ДополнительнаяАналитика <> Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона
			И ВыборкаДетальныеЗаписи.ДополнительнаяАналитика <> Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		СуммаКурсовойРазницы = Окр(ВыборкаДетальныеЗаписи.СуммаВВалютеУчета, 2) - ВыборкаДетальныеЗаписи.СуммаОстаток;
		Если СуммаКурсовойРазницы = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыКурсовойРазницы = Новый Структура("СуммаКурсовойРазницы, Валюта, Счет, ВидСчетаУчета, Субконто1, Субконто2, Субконто3, ДополнительнаяАналитика",
			СуммаКурсовойРазницы, 
			ВыборкаДетальныеЗаписи.Валюта,
			ВыборкаДетальныеЗаписи.Счет,
			ВыборкаДетальныеЗаписи.ВидСчета,
			ВыборкаДетальныеЗаписи.Субконто1,
			ВыборкаДетальныеЗаписи.Субконто2,
			ВыборкаДетальныеЗаписи.Субконто3,
			ВыборкаДетальныеЗаписи.ДополнительнаяАналитика);
			
		Если НастройкиУчета.ОтражатьПартииНаЛицевыхСчетах Тогда
		
			ПараметрыКурсовойРазницы.Вставить("Партия", ВыборкаДетальныеЗаписи.ЛицевойСчет.Партия);
			ПараметрыКурсовойРазницы.Вставить("СтрокаПартии", ВыборкаДетальныеЗаписи.ЛицевойСчет.СтрокаПартии);
		
		КонецЕсли;
			
		БухгалтерскийУчетЕПС.ДобавитьПроводкуКурсовойРазницы(ЭтотОбъект, ПараметрыКурсовойРазницы, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Функция Перекурсовка(СтрокаПартий, Отказ)
	
	НовоеДвижение = Движения.БухПартииЦенныхБумаг.Добавить();
	
	НовоеДвижение.Организация		= ЭтотОбъект.Организация;
	НовоеДвижение.СчетДоверительногоУправления		= ЭтотОбъект.СчетДоверительногоУправления;
	НовоеДвижение.ВидУчета			= Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
	НовоеДвижение.ЦеннаяБумага 		= СтрокаПартий.ЦеннаяБумага;
	НовоеДвижение.УчетныйАктивЕПС 	= СтрокаПартий.УчетныйАктивЕПС;
	НовоеДвижение.Партия 			= СтрокаПартий.Партия;
	НовоеДвижение.СтрокаПартии 		= СтрокаПартий.СтрокаПартии;
	НовоеДвижение.Рынок 			= СтрокаПартий.Рынок;
	
	НовоеДвижение.ВидДвижения 		= Перечисления.ВидыДвижений.Приход;
	НовоеДвижение.Регистратор 		= ЭтотОбъект.Ссылка;
	НовоеДвижение.Период 			= ЭтотОбъект.Дата;
		
	СуммыВВалюте = Новый Структура();
	СуммыВВалюте.Вставить("СтоимостьВВалютеУчета", СтрокаПартий.Стоимость);
	СуммыВВалюте.Вставить("СтоимостьКупонаВВалютеУчета", СтрокаПартий.СтоимостьКупона);
	СуммыВВалюте.Вставить("ПереоценкаВВалютеУчета", СтрокаПартий.Переоценка);
	СуммыВВалюте.Вставить("ПереоценкаКупонаВВалютеУчета", СтрокаПартий.ПереоценкаКупона);
	СуммыВВалюте.Вставить("ДисконтПремияНачисленныйВВалютеУчета", СтрокаПартий.ДисконтПремияНачисленный);
	СуммыВВалюте.Вставить("КорректировкаЭСПВВалютеУчета", СтрокаПартий.КорректировкаЭСП);
	СуммыВВалюте.Вставить("РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета", СтрокаПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
	
	РаботаСВалютами.ПолучитьСуммыВВалютеУчета(СуммыВВалюте, СтрокаПартий.ЦеннаяБумага.ВалютаНоминала, ЭтотОбъект.Организация, ЭтотОбъект.Дата, , Отказ);
	
	НовоеДвижение.СтоимостьВВалютеУчета = (СуммыВВалюте.СтоимостьВВалютеУчета - СтрокаПартий.СтоимостьВВалютеУчета);
	НовоеДвижение.СтоимостьКупонаВВалютеУчета = (СуммыВВалюте.СтоимостьКупонаВВалютеУчета - СтрокаПартий.СтоимостьКупонаВВалютеУчета);
	НовоеДвижение.ПереоценкаВВалютеУчета = (СуммыВВалюте.ПереоценкаВВалютеУчета - СтрокаПартий.ПереоценкаВВалютеУчета);
	НовоеДвижение.ПереоценкаКупонаВВалютеУчета = (СуммыВВалюте.ПереоценкаКупонаВВалютеУчета - СтрокаПартий.ПереоценкаКупонаВВалютеУчета);
	НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = (СуммыВВалюте.ДисконтПремияНачисленныйВВалютеУчета - СтрокаПартий.ДисконтПремияНачисленныйВВалютеУчета);
	НовоеДвижение.КорректировкаЭСПВВалютеУчета = (СуммыВВалюте.КорректировкаЭСПВВалютеУчета - СтрокаПартий.КорректировкаЭСПВВалютеУчета);
	НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = (СуммыВВалюте.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета - СтрокаПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета);
	НовоеДвижение.КурсовыеРазницыСНачалаГода = НовоеДвижение.СтоимостьВВалютеУчета + НовоеДвижение.СтоимостьКупонаВВалютеУчета + НовоеДвижение.ПереоценкаВВалютеУчета + 
		НовоеДвижение.ПереоценкаКупонаВВалютеУчета + НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета + НовоеДвижение.КорректировкаЭСПВВалютеУчета + 
		НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета + НовоеДвижение.КурсовыеРазницыСНачалаГода;
		
		
	ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, УчетныйАктивЕПС, "
		+ "СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета, "
		+ "ДисконтПремияНачисленныйВВалютеУчета, КорректировкаЭСПВВалютеУчета, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,"
		+ "ДисконтПремияНачисленныйОстаток, ПереоценкаОстаток, КорректировкаЭСПОстаток, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток",
		НовоеДвижение.ЦеннаяБумага, НовоеДвижение.УчетныйАктивЕПС,
		НовоеДвижение.СтоимостьВВалютеУчета, НовоеДвижение.СтоимостьКупонаВВалютеУчета, НовоеДвижение.ПереоценкаВВалютеУчета, НовоеДвижение.ПереоценкаКупонаВВалютеУчета,
		НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета, НовоеДвижение.КорректировкаЭСПВВалютеУчета, НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		СтрокаПартий.ДисконтПремияНачисленный,СтрокаПартий.Переоценка,СтрокаПартий.КорректировкаЭСП,СтрокаПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
	
		
	БухгалтерскийУчетЕПС.ДвижениеПерекурсовки(ЭтотОбъект, ПараметрыПерекурсовки, Отказ);		
	
	Возврат НовоеДвижение;
	
КонецФункции

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда // блокирующие проверки
		
		// !!! почему так - см. в обработке проведения
		//Если Не РегистрыСведений.НастройкиУчетаОбщие.ВедетсяУчетПоВиду(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + " у " + ЭтотОбъект.СчетДоверительногоУправления + " не ведется " + ЭтотОбъект.ВидУчета,,,, Отказ);
		//	Возврат;
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);
	Движения[УчетныйРегистр].Записать();//очистим движения перед запросом остатков на конец дня
	Движения[УчетныйРегистр].Записывать = Истина;	
	
	ПроведениеПоРегиструБухгалтерииДрагоценныеМеталлы(УчетныйРегистр, Отказ);
	
	//а надо?
	Если НЕ Документы.ПереоценкаВалютныхЦенностей.НужнаПерекурсовка(Дата, Организация, СчетДоверительногоУправления, ВидУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		ОбработкаПроведенияЕПС(Отказ, Режим);
		Возврат;
	КонецЕсли;
	
	НастройкиУчетаОбщие  = БухгалтерскийУчет.ОпределитьНастройкиУчета(Дата, Организация, СчетДоверительногоУправления);
	
	ДатаПереоценки = НачалоДня(ЭтотОбъект.Дата);
	
	МассивУчетныеАктивыПоЦБ = Новый Массив;
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.Акции);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.АкцииИностранныхЭмитентов);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.ВекселяДисконтные);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.ВекселяПроцентные);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.Еврооблигации);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.ЕврооблигацииКупон);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалюте);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.ОблигацииКорпоративные);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.ОблигацииКорпоративныеКупон);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.Паи);
	МассивУчетныеАктивыПоЦБ.Добавить(Справочники.УчетныеАктивы.ПаиИностранныхЭмитентов);
	
	ЦенныеБумагиЯвляющиесяДефолтнымиПоМнениюКлиента = БухгалтерскийУчетЕПС.ПолучитьЦенныеБумагиЯвляющиесяДефолтнымиПоМнениюКлиента(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НастройкиУчетаАктивовСрезПоследних.СчетУчета КАК СчетУчета,
		|	НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценки КАК СчетУчетаПереоценки,
		|	НастройкиУчетаАктивовСрезПоследних.СчетУчетаВЗалоге КАК СчетУчетаВЗалоге,
		|	НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценкиВЗалоге КАК СчетУчетаПереоценкиВЗалоге
		|ПОМЕСТИТЬ _СчетаУчета
		|ИЗ
		|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
		|			&НаДату,
		|			ВидУчета = &ВидУчета
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И УчетныйАктив В (&МассивУчетныеАктивыПоЦБ)) КАК НастройкиУчетаАктивовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаУчета.СчетУчета КАК Счет
		|ПОМЕСТИТЬ _СчетаУчетаРазвернуто
		|ИЗ
		|	_СчетаУчета КАК _СчетаУчета
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_СчетаУчета.СчетУчетаПереоценки
		|ИЗ
		|	_СчетаУчета КАК _СчетаУчета
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_СчетаУчета.СчетУчетаВЗалоге
		|ИЗ
		|	_СчетаУчета КАК _СчетаУчета
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_СчетаУчета.СчетУчетаПереоценкиВЗалоге
		|ИЗ
		|	_СчетаУчета КАК _СчетаУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Основной.Ссылка КАК Счет
		|ПОМЕСТИТЬ _СчетаДляПерекурсовки
		|ИЗ
		|	ПланСчетов.Основной КАК Основной
		|ГДЕ
		|	Основной.Валютный
		|	И НЕ Основной.Забалансовый
		|	И НЕ Основной.Ссылка В
		|				(ВЫБРАТЬ
		|					_СчетаУчетаРазвернуто.Счет
		|				ИЗ
		|					_СчетаУчетаРазвернуто)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Счет КАК Счет,
		|	БухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
		|	БухгалтерскийУчетОстатки.Субконто2 КАК Субконто2,
		|	БухгалтерскийУчетОстатки.Субконто3 КАК Субконто3,
		|	БухгалтерскийУчетОстатки.Валюта КАК Валюта,
		|	(ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток * КурсВалютыОстатка.Курс / КурсВалютыОстатка.Кратность / КурсВалютыУчета.Курс * КурсВалютыУчета.Кратность КАК ЧИСЛО(21, 2))) - БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаКурсовойРазницы,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОстатки.СуммаОстаток > 0
		|						ТОГДА ЗНАЧЕНИЕ(ВидСчета.Активный)
		|					ИНАЧЕ ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|				КОНЕЦ
		|		ИНАЧЕ БухгалтерскийУчетОстатки.Счет.Вид
		|	КОНЕЦ КАК ВидСчетаУчета
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&КонецДняПереоценки,
		|			Счет В
		|				(ВЫБРАТЬ
		|					_СчетаДляПерекурсовки.Счет
		|				ИЗ
		|					_СчетаДляПерекурсовки),
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И Валюта <> &ВалютаУчета) КАК БухгалтерскийУчетОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыОстатка
		|		ПО БухгалтерскийУчетОстатки.Валюта = КурсВалютыОстатка.Валюта,
		|	РегистрСведений.КурсыВалют КАК КурсВалютыУчета
		|ГДЕ
		|	КурсВалютыУчета.Валюта = &ВалютаУчета
		|	И КурсВалютыОстатка.Период = &Период
		|	И КурсВалютыУчета.Период = &Период
		|	И НЕ БухгалтерскийУчетОстатки.Субконто1 В (&ДефолтныеБумаги)
		|	И (БухгалтерскийУчетОстатки.Субконто2 ЕСТЬ NULL
		|			ИЛИ НЕ БухгалтерскийУчетОстатки.Субконто2 В (&ДефолтныеБумаги))
		|	И (БухгалтерскийУчетОстатки.Субконто3 ЕСТЬ NULL
		|			ИЛИ НЕ БухгалтерскийУчетОстатки.Субконто3 В (&ДефолтныеБумаги))
		|	И (ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток * КурсВалютыОстатка.Курс / КурсВалютыОстатка.Кратность / КурсВалютыУчета.Курс * КурсВалютыУчета.Кратность КАК ЧИСЛО(21, 2))) - БухгалтерскийУчетОстатки.СуммаОстаток <> 0";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета));
	
	Запрос.УстановитьПараметр("ВидУчета", ВидУчета);
	Запрос.УстановитьПараметр("МассивУчетныеАктивыПоЦБ", МассивУчетныеАктивыПоЦБ);
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВалютаУчета", Организация.ВалютаУчета);
	Запрос.УстановитьПараметр("Период", ДатаПереоценки);
	Запрос.УстановитьПараметр("КонецДняПереоценки", Новый Граница(КонецДня(ДатаПереоценки), ВидГраницы.Включая));
	// задложенности по дефолтным облигациям не трогаем
	Запрос.УстановитьПараметр("ДефолтныеБумаги", ЦенныеБумагиЯвляющиесяДефолтнымиПоМнениюКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыКурсовойРазницы = Новый Структура("СуммаКурсовойРазницы, Валюта, Счет, ВидСчетаУчета, Субконто1, Субконто2, Субконто3");
		
		ЗаполнитьЗначенияСвойств(ПараметрыКурсовойРазницы, ВыборкаДетальныеЗаписи);
		
		Если НЕ БухгалтерскийУчет.КурсоваяРазницаПереоценкиУдовлетворяет67ФЗ(ПараметрыКурсовойРазницы.СуммаКурсовойРазницы, ЭтотОбъект.ВидУчета, ПараметрыКурсовойРазницы.Счет, ЭтотОбъект.Дата) Тогда 			
			БухгалтерскийУчет.ДобавитьПроводкуКурсовойРазницы(ЭтотОбъект, УчетныйРегистр, ПараметрыКурсовойРазницы, НастройкиУчетаОбщие, Ложь, Отказ);
		Иначе 
			Если ПараметрыКурсовойРазницы.Счет  = ПланыСчетов.Основной.ПредоставленныеЗаймы 
				И ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда 
				// #542182 
				БухгалтерскийУчет.ДобавитьПроводкуКурсовойРазницы(ЭтотОбъект, УчетныйРегистр, ПараметрыКурсовойРазницы, НастройкиУчетаОбщие, Истина, Отказ);;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерииДрагоценныеМеталлыПереоценкаОстатков(УчетныйРегистр, НастройкиУчетаАктива, Отказ)
	
	СчетПрочиеРасходы				= ПланыСчетов.Основной.ПрочиеРасходы;
	СчетПрочиеДоходы				= ПланыСчетов.Основной.ПрочиеДоходы;
	ВидСубконтоУчетаЦеннойБумаги	= БухгалтерскийУчет.ОпределитьВидСубконтоУчетаЦеннойБумаги(Перечисления.РынкиЦенныхБумаг.ДрагоценныеМеталлы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	БухгалтерскийУчетОстатки.КоличествоОстатокДт КАК КоличествоОстаток,
		|	БухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаОстаток,
		|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстаток,
		|	БухгалтерскийУчетОстатки.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ОстаткиАктива
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&Граница,
		|			Счет = &СчетУчетаАктивов,
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета) КАК БухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
		|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
		|	БухгалтерскийУчетОстатки.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ОстаткиПереоценки
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&Граница,
		|			Счет = &СчетУчетаПереоценки,
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета) КАК БухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ОстаткиАктива.ЦеннаяБумага, _ОстаткиПереоценки.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) * КотировкиТорговыхПлощадок.CLOSE - (ЕСТЬNULL(_ОстаткиАктива.СуммаОстаток, 0) + ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0)) КАК СуммаПереоценки,
		|	ЕСТЬNULL(_ОстаткиАктива.Валюта, _ОстаткиПереоценки.Валюта) КАК Валюта
		|ИЗ
		|	_ОстаткиАктива КАК _ОстаткиАктива
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ОстаткиПереоценки КАК _ОстаткиПереоценки
		|		ПО _ОстаткиАктива.ЦеннаяБумага = _ОстаткиПереоценки.ЦеннаяБумага
		|			И _ОстаткиАктива.Валюта = _ОстаткиПереоценки.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок.СрезПоследних(
		|				&Граница,
		|				Биржа = &БиржаММВБ
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы)) КАК КотировкиТорговыхПлощадок
		|		ПО (КотировкиТорговыхПлощадок.ЦеннаяБумага = ЕСТЬNULL(_ОстаткиАктива.ЦеннаяБумага, _ОстаткиПереоценки.ЦеннаяБумага))
		|ГДЕ
		|	ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) * КотировкиТорговыхПлощадок.CLOSE - (ЕСТЬNULL(_ОстаткиАктива.СуммаОстаток, 0) + ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0)) <> 0";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета));
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("СчетУчетаАктивов", НастройкиУчетаАктива.СчетУчета);
	Запрос.УстановитьПараметр("СчетУчетаПереоценки", НастройкиУчетаАктива.СчетУчетаПереоценки);
	Запрос.УстановитьПараметр("БиржаММВБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], ?(ВыборкаДетальныеЗаписи.СуммаПереоценки<0,-1,1) * ВыборкаДетальныеЗаписи.СуммаПереоценки, "Переоценка ТБС");
		
		Если ВыборкаДетальныеЗаписи.СуммаПереоценки > 0 Тогда
			Проводка.СчетДт = НастройкиУчетаАктива.СчетУчетаПереоценки;
			Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			
			Если НастройкиУчетаАктива.СчетУчетаПереоценки.Валютный Тогда
				Проводка.ВалютнаяСуммаДт = РаботаСВалютами.ПересчетСуммыВВалюте(?(ВыборкаДетальныеЗаписи.СуммаПереоценки<0,-1,1) * ВыборкаДетальныеЗаписи.СуммаПереоценки, ЭтотОбъект.Организация.ВалютаУчета, ЭтотОбъект.Дата, ВыборкаДетальныеЗаписи.Валюта, ЭтотОбъект.Дата, Отказ);
				Проводка.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
			КонецЕсли;
			
			Проводка.СчетКт = СчетПрочиеДоходы;
			Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
			Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			Проводка.СубконтоКт.ОбращаетсяНаОРЦБ		= Ложь;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.СуммаПереоценки < 0 Тогда
			
			//кредит. дебет потом
			Проводка.СчетКт = НастройкиУчетаАктива.СчетУчетаПереоценки;
			Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			
			Если НастройкиУчетаАктива.СчетУчетаПереоценки.Валютный Тогда
				Проводка.ВалютнаяСуммаКт = РаботаСВалютами.ПересчетСуммыВВалюте(?(ВыборкаДетальныеЗаписи.СуммаПереоценки<0,-1,1) * ВыборкаДетальныеЗаписи.СуммаПереоценки, ЭтотОбъект.Организация.ВалютаУчета, ЭтотОбъект.Дата, ВыборкаДетальныеЗаписи.Валюта, ЭтотОбъект.Дата, Отказ);
				Проводка.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
			КонецЕсли;			
			//дебет			
			Проводка.СчетДт = СчетПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
			Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Ложь;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПроведениеПоРегиструБухгалтерииДрагоценныеМеталлыПереоценкаНезавершенныхСделок(УчетныйРегистр, НастройкиУчетаАктива, Отказ)
	
	СчетПрочиеРасходы				= ПланыСчетов.Основной.ПрочиеРасходы;
	СчетПрочиеДоходы				= ПланыСчетов.Основной.ПрочиеДоходы;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Сделка,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _ОстаткиАктива
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&Граница,
		|			Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Субконто1 КАК Сделка,
		|	БухгалтерскийУчетОстатки.Валюта КАК Валюта,
		|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
		|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаПереоценкиОстаток
		|ПОМЕСТИТЬ _ОстаткиПереоценки
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&Граница,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоПереоценкеНезавершенныхСделок),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Сделка),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета) КАК БухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПРЕДСТАВЛЕНИЕ(_ОстаткиПереоценки.Сделка) КАК Сделка,
		|	ПРЕДСТАВЛЕНИЕ(_ОстаткиПереоценки.Валюта) КАК Валюта,
		|	_ОстаткиПереоценки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _НеСписанныеИсполнениямиСуммы
		|ИЗ
		|	_ОстаткиПереоценки КАК _ОстаткиПереоценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиАктива КАК _ОстаткиАктива
		|		ПО (_ОстаткиАктива.Сделка = _ОстаткиПереоценки.Сделка)
		|			И (_ОстаткиАктива.Валюта = _ОстаткиПереоценки.Валюта)
		|ГДЕ
		|	_ОстаткиАктива.Сделка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиАктива.Сделка КАК Сделка,
		|	_ОстаткиАктива.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиАктива.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА _ОстаткиАктива.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) * КотировкиТорговыхПлощадокСрезПоследних.CLOSE - (ЕСТЬNULL(_ОстаткиАктива.СуммаОстаток, 0) + ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0))
		|		ИНАЧЕ ЕСТЬNULL(_ОстаткиАктива.СуммаОстаток, 0) - ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0) - ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) * КотировкиТорговыхПлощадокСрезПоследних.CLOSE
		|	КОНЕЦ КАК СуммаПереоценки,
		|	_ОстаткиАктива.Сделка.Брокер КАК Брокер
		|ИЗ
		|	_ОстаткиАктива КАК _ОстаткиАктива
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПереоценки КАК _ОстаткиПереоценки
		|		ПО _ОстаткиАктива.Сделка = _ОстаткиПереоценки.Сделка
		|			И _ОстаткиАктива.Валюта = _ОстаткиПереоценки.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок.СрезПоследних(
		|				&Граница,
		|				Биржа = &БиржаММВБ
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы)) КАК КотировкиТорговыхПлощадокСрезПоследних
		|		ПО (КотировкиТорговыхПлощадокСрезПоследних.ЦеннаяБумага = _ОстаткиАктива.ЦеннаяБумага)";
	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета));
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("БиржаММВБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНеСписанныеИсполнениямиСуммы = Запрос.МенеджерВременныхТаблиц.Таблицы["_НеСписанныеИсполнениямиСуммы"].ПолучитьДанные().Выбрать();
	
	Если ВыборкаНеСписанныеИсполнениямиСуммы.Количество() > 0 Тогда
		Пока ВыборкаНеСписанныеИсполнениямиСуммы.Следующий() Цикл
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По счету ДУ " + ЭтотОбъект.СчетДоверительногоУправления + " и сделке " + ВыборкаНеСписанныеИсполнениямиСуммы.Сделка + " обнаружена не списанная переоценка незавешенных сделок на сумму " + Формат(ВыборкаНеСписанныеИсполнениямиСуммы.СуммаОстаток, "ЧЦ=15; ЧДЦ=2") ,,,,Отказ); 
	
		КонецЦикла;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СубконтоДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(СчетДоверительногоУправления, ВыборкаДетальныеЗаписи.Брокер, Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], ?(ВыборкаДетальныеЗаписи.СуммаПереоценки<0,-1,1) * ВыборкаДетальныеЗаписи.СуммаПереоценки, "Переоценка НС");
		
		Если ВыборкаДетальныеЗаписи.СуммаПереоценки >= 0 Тогда
			Проводка.СчетДт = ПланыСчетов.Основной.РасчетыПоПереоценкеНезавершенныхСделок;
			Проводка.СубконтоДт.Сделка = ВыборкаДетальныеЗаписи.Сделка;
			Проводка.СубконтоДт.БрокерскиеКомпании = ВыборкаДетальныеЗаписи.Брокер;
			Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
			
			Проводка.ВалютнаяСуммаДт = РаботаСВалютами.ПересчетСуммыВВалюте(?(ВыборкаДетальныеЗаписи.СуммаПереоценки<0,-1,1) * ВыборкаДетальныеЗаписи.СуммаПереоценки, ЭтотОбъект.Организация.ВалютаУчета, ЭтотОбъект.Дата, ВыборкаДетальныеЗаписи.Валюта, ЭтотОбъект.Дата, Отказ);
			Проводка.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
			
			Проводка.СчетКт = СчетПрочиеДоходы;
			Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
			Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			Проводка.СубконтоКт.ОбращаетсяНаОРЦБ		= Ложь;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.СуммаПереоценки < 0 Тогда
			
			//кредит. дебет потом
			Проводка.СчетКт = ПланыСчетов.Основной.РасчетыПоПереоценкеНезавершенныхСделок;
			Проводка.СубконтоКт.Сделка = ВыборкаДетальныеЗаписи.Сделка;
			Проводка.СубконтоКт.БрокерскиеКомпании = ВыборкаДетальныеЗаписи.Брокер;
			Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
			
			Проводка.ВалютнаяСуммаКт = РаботаСВалютами.ПересчетСуммыВВалюте(?(ВыборкаДетальныеЗаписи.СуммаПереоценки<0,-1,1) * ВыборкаДетальныеЗаписи.СуммаПереоценки, ЭтотОбъект.Организация.ВалютаУчета, ЭтотОбъект.Дата, ВыборкаДетальныеЗаписи.Валюта, ЭтотОбъект.Дата, Отказ);
			Проводка.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
				
			//дебет			
			Проводка.СчетДт = СчетПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
			Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Ложь;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПроведениеПоРегиструБухгалтерииДрагоценныеМеталлы(УчетныйРегистр, Отказ)
	
	Если ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет Или ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда
		
		УчетныйАктив					= БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, Перечисления.РынкиЦенныхБумаг.ДрагоценныеМеталлы, Неопределено);
		НастройкиУчетаАктива			= БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Дата, Организация, СчетДоверительногоУправления, УчетныйАктив, УчетныйРегистр);
		
		ПроведениеПоРегиструБухгалтерииДрагоценныеМеталлыПереоценкаНезавершенныхСделок(УчетныйРегистр, НастройкиУчетаАктива, Отказ);
		
		ПериодичностьПереоценки = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.ДрагоценныеМеталлы, ВидУчета, "ПериодичностьПереоценки");
		
		Если ЗначениеЗаполнено(ПериодичностьПереоценки)
			И ПериодичностьПереоценки <> Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда
			
			КалендарьДляСчетаДУ = РаботаСПереоценкой.ПолучитьКалендарьДляСчетаДУ(Организация, СчетДоверительногоУправления, Дата);
			
			Если БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьПереоценки, Дата, КалендарьДляСчетаДУ) Тогда 
				ПроведениеПоРегиструБухгалтерииДрагоценныеМеталлыПереоценкаОстатков(УчетныйРегистр, НастройкиУчетаАктива, Отказ);	
			КонецЕсли;	
			
		КонецЕсли;	
		
	ИначеЕсли ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда	
		
		// По ЕПС пока что учет драгоценных металлов не определен.
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти
